max-bot-cf/InformationRegisters/энргКлючиПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКлючиПомещений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

max-bot-cf/InformationRegisters/энргКлючиПомещений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет данные помещения.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ДанныеПомещения(Схема,Параметры, ТаблицаДляПомещения = "ДанныеПомещения") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема 								= Новый СхемаЗапроса;
		Пакет 								= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДанныеПомещения());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
		
	Если Параметры.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры = "Строение, Помещение, КлючПомещения";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор, "энргКлючиПомещений", Параметры.ПараметрыВТ, ДоступныеПараметры,, Пакет.Операторы);		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет данные помещений.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ДанныеПомещений(Схема,Параметры, ТаблицаДляПомещения = "ЗначенияКлючейПомещений") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема 								= Новый СхемаЗапроса;
		Пакет 								= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗначенияКлючейПомещений());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
		
	Если Параметры.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры = "Строение, Помещение, КлючПомещения";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор, "энргКлючиПомещений", Параметры.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
КонецПроцедуры

// Получает результат данные помещения по ключу.
//
// Параметры:
//  КлючПомещения	-	СправочникСсылка.энргКлючиПомещений.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция РезультатДанныеПомещенияПоКлючу(КлючПомещения) Экспорт 
	
	Схема 							= Неопределено;
	ПараметрыСхемы 					= Новый Структура;
	ПараметрыВТ 					= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей", "ТипПараметраРавно", Новый Структура("КлючПомещения", "КлючПомещения")));
	ПараметрыСхемы.Вставить("ПараметрыВТ",ПараметрыВТ);
	ДанныеПомещения(Схема,ПараметрыСхемы,"");
	
	ПараметрыЗапроса  				= Новый Структура;
	ПараметрыЗапроса.Вставить("КлючПомещения", КлючПомещения);
	
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);
			
КонецФункции

// Получает ключ помещения по строению и помещению.
//
// Параметры:
//  Строение	 - 	СправочникСсылка.энргСтроения.
//  Помещение	 - 	СправочникСсылка.энргПомещения.
// 
// Возвращаемое значение:
//   Структура.
//
Функция КлючПомещенияПоСтроениюИПомещению(Строение, Помещение) Экспорт 
	Если ЗначениеЗаполнено(Помещение) И НЕ ЗначениеЗаполнено(Строение) ТОгда
		// todo fix me
		Строение  					= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Помещение, "Строение");
	КонецЕсли;	
	
	Схема 							= Неопределено;
	ПараметрыСхемы 					= Новый Структура;
	ПараметрыВТ 					= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей", "ТипПараметраРавно", Новый Структура("Строение,Помещение", "Строение", "Помещение")));
	ПараметрыСхемы.Вставить("ПараметрыВТ",ПараметрыВТ);
	ДанныеПомещения(Схема,ПараметрыСхемы,"");
	
	ПараметрыЗапроса  				= Новый Структура;
	ПараметрыЗапроса.Вставить("Строение", 	Строение);
	ПараметрыЗапроса.Вставить("Помещение", 	Помещение);
	
	РезультатЗапроса 				= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);
	Результат 						= Новый Структура("Строение,Помещение,ЧастныйСектор,МКД,КлючПомещения,Район");
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка  					= РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

// Получает данные помещения с отбором.
//
// Параметры:
//  Строение	 - 	СправочникСсылка.энргСтроения.
//  Помещение	 - 	СправочникСсылка.энргПомещения.
// 
// Возвращаемое значение:
//   Структура.
//
Функция ПолучитьДанныеПомещенияСОтбором(Строение, Помещение) Экспорт 
	
	Данные = Новый Структура("КлючПомещения, ЧастныйСектор",Справочники.энргКлючиПомещений.ПустаяСсылка(), Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор,
		|	энргКлючиПомещений.КлючПомещения КАК КлючПомещения
		|ИЗ
		|	РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
		|ГДЕ
		|	энргКлючиПомещений.Строение = &Строение
		|	И энргКлючиПомещений.Помещение = &Помещение";
	
	Запрос.УстановитьПараметр("Помещение"	, Помещение);
	Запрос.УстановитьПараметр("Строение"	, Строение);
	
	РезультатЗапроса 	= Запрос.Выполнить();	
	Выборка 			= РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Данные,Выборка);
	КонецЕсли;
	
	Возврат Данные;	
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаДанныеПомещения()
	
	Текст  		=
	"ВЫБРАТЬ
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Помещение КАК Помещение,
	|	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор,
	|	ВЫБОР
	|		КОГДА НЕ энргКлючиПомещений.ЧастныйСектор
	|			ТОГДА энргКлючиПомещений.Строение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|	КОНЕЦ КАК МКД,
	|	энргКлючиПомещений.КлючПомещения КАК КлючПомещения,
	|	энргСтроения.Район КАК Район,
	|	энргКлючиПомещений.Помещение.Родитель КАК ПомещениеРодитель
	|ИЗ
	|	РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргСтроения КАК энргСтроения
	|		ПО энргКлючиПомещений.Строение = энргСтроения.Ссылка";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаЗначенияКлючейПомещений()
	
	Текст  		=
	"ВЫБРАТЬ
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Помещение КАК Помещение,
	|	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор,
	|	энргКлючиПомещений.КлючПомещения КАК КлючПомещения
	|ИЗ
	|	РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
